FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидДокументаУдостоверяющегоЛичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидДокументаУдостоверяющегоЛичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПаспортГражданинаРоссийскойФедерации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПаспортГражданинаРФСлужебныйПаспортДипПаспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеУдостоверениеЛичностиГражданинаРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОРожденииГражданинаРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеДокументыУдостоверяющиеЛичностьГражданинаРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПаспортИностранногоГражданина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеДокументыУдостоверяющиеЛичностьИностранногоГражданина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументВыданныйИностраннымГосударствомПризнаваемыйУдостоверяющимЛичность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешениеНаВременноеПроживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СвидетельствоОРассмотренииХодатайстваОПризнанииБеженцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдостоверениеБеженца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИныеДокументыПризнаваемыеДокументамиУдостоверяющимиЛичностьЛицБезГражданства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументУдостоверяющийЛичностьЛицаБезДокументаНаПериодРассмотренияИлиПриема</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/ВидДокументаУдостоверяющегоЛичность/Ext/ManagerModule.bsl
Функция КодВидаДокументаУдостоверяющегоЛичность(ВидДокументаУдостоверяющегоЛичность) Экспорт
	
	КодыВидаДокумента = Новый Соответствие();
	
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ВидНаЖительство"), 34);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ВременноеУдостоверениеЛичностиГражданинаРФ"), 26);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ДокументВыданныйИностраннымГосударствомПризнаваемыйУдостоверяющимЛичность"), 33);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ДокументУдостоверяющийЛичностьЛицаБезДокументаНаПериодРассмотренияИлиПриема"), 40);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ИныеДокументыПризнаваемыеДокументамиУдостоверяющимиЛичностьЛицБезГражданства"), 38);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ИныеДокументыУдостоверяющиеЛичностьГражданинаРФ"), 28);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ИныеДокументыУдостоверяющиеЛичностьИностранногоГражданина"), 32);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ПаспортГражданинаРоссийскойФедерации"), 21);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ПаспортГражданинаРФСлужебныйПаспортДипПаспорт"), 22);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ПаспортИностранногоГражданина"), 31);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.РазрешениеНаВременноеПроживание"), 35);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.СвидетельствоОРассмотренииХодатайстваОПризнанииБеженцем"), 36);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.СвидетельствоОРожденииГражданинаРФ"), 27);
	КодыВидаДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.УдостоверениеБеженца"), 37);
	
	Возврат КодыВидаДокумента.Получить(ВидДокументаУдостоверяющегоЛичность);
	
КонецФункции

Функция ВидДокументаУдостоверяющегоЛичностьПоКоду(КодВидаДокументаУдостоверяющегоЛичность) Экспорт
	
	ВидыДокумента = ВидыДокументовУдостоверяющихЛичность();
	Возврат ВидыДокумента.Получить(КодВидаДокументаУдостоверяющегоЛичность);
	
КонецФункции

Функция КодВидаДокументаУдостоверяющегоЛичностьПоВидуПодтверждающегоДокумента(ВидПодтвержающегоДокумента) Экспорт
	
	ВидыДокумента = Новый Соответствие();
	
	ВидыДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВидНаЖительствоИностранногоГражданина"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ВидНаЖительство"));
	ВидыДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.ВоенныйБилет"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ИныеДокументыУдостоверяющиеЛичностьГражданинаРФ"));
	ВидыДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.Паспорт"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ПаспортГражданинаРоссийскойФедерации"));
	ВидыДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.Свидетельство"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.СвидетельствоОРожденииГражданинаРФ"));
	ВидыДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.Удостоверение"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ИныеДокументыУдостоверяющиеЛичностьГражданинаРФ"));
	ВидыДокумента.Вставить(ПредопределенноеЗначение("Перечисление.ВидыДокументов.Прочее"), ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ИныеДокументыУдостоверяющиеЛичностьГражданинаРФ"));
	
	ВидДокумента = ВидыДокумента.Получить(ВидПодтвержающегоДокумента);
	
	Если ВидДокумента = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	КодВидаДокумента = КодВидаДокументаУдостоверяющегоЛичность(ВидДокумента);
	Если КодВидаДокумента = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Возврат КодВидаДокумента;
	
КонецФункции

Функция ВидыДокументовУдостоверяющихЛичность() Экспорт
	
	ВидыДокумента = Новый Соответствие();
	
	ВидыДокумента.Вставить(34, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ВидНаЖительство"));
	ВидыДокумента.Вставить(26, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ВременноеУдостоверениеЛичностиГражданинаРФ"));
	ВидыДокумента.Вставить(33, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ДокументВыданныйИностраннымГосударствомПризнаваемыйУдостоверяющимЛичность"));
	ВидыДокумента.Вставить(40, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ДокументУдостоверяющийЛичностьЛицаБезДокументаНаПериодРассмотренияИлиПриема"));
	ВидыДокумента.Вставить(38, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ИныеДокументыПризнаваемыеДокументамиУдостоверяющимиЛичностьЛицБезГражданства"));
	ВидыДокумента.Вставить(28, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ИныеДокументыУдостоверяющиеЛичностьГражданинаРФ"));
	ВидыДокумента.Вставить(32, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ИныеДокументыУдостоверяющиеЛичностьИностранногоГражданина"));
	ВидыДокумента.Вставить(21, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ПаспортГражданинаРоссийскойФедерации"));
	ВидыДокумента.Вставить(22, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ПаспортГражданинаРФСлужебныйПаспортДипПаспорт"));
	ВидыДокумента.Вставить(31, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.ПаспортИностранногоГражданина"));
	ВидыДокумента.Вставить(35, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.РазрешениеНаВременноеПроживание"));
	ВидыДокумента.Вставить(36, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.СвидетельствоОРассмотренииХодатайстваОПризнанииБеженцем"));
	ВидыДокумента.Вставить(27, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.СвидетельствоОРожденииГражданинаРФ"));
	ВидыДокумента.Вставить(37, ПредопределенноеЗначение("Перечисление.ВидДокументаУдостоверяющегоЛичность.УдостоверениеБеженца"));
	
	Возврат ВидыДокумента;
КонецФункции
